[
    {
        "title": "China Halts Critical Exports as Trade War Intensifies",
        "abstract": "Beijing has suspended exports of certain rare earth minerals and magnets that are crucial for the world’s car, semiconductor and aerospace industries.",
        "published_date": "2025-04-13T13:29:01-04:00",
        "url": "https://www.nytimes.com/2025/04/13/business/china-rare-earths-exports.html"
    },
    {
        "title": "Trump Has Added Risk to the Surest Bet in Global Finance",
        "abstract": "Shocked by Trump’s trade war, foreign investors are selling U.S. government bonds, long the world’s safe haven.",
        "published_date": "2025-04-13T05:04:40-04:00",
        "url": "https://www.nytimes.com/2025/04/13/business/trump-risk-us-bonds.html"
    },
    {
        "title": "A Devastating Trade Spat With China Shows Few Signs of Abating",
        "abstract": "The Trump administration is in a standoff with the Chinese government as trade tensions escalate, leaving U.S. businesses in the cross hairs",
        "published_date": "2025-04-13T05:01:44-04:00",
        "url": "https://www.nytimes.com/2025/04/13/us/politics/trump-tariffs-trade-war-china.html"
    },
    {
        "title": "The Treasury Secretary Is Wrong About How Most Retirees See the Stock Market",
        "abstract": "We asked readers who were on the cusp of retirement whether they were watching the markets. About 400 replied.",
        "published_date": "2025-04-13T05:01:02-04:00",
        "url": "https://www.nytimes.com/2025/04/13/your-money/retirement-bessent-stock-market.html"
    },
    {
        "title": "How Should You Invest for College During Market Swings?",
        "abstract": "Parents who put money into 529 plans may find it tricky to find the right investment strategies while the stock market is in turmoil.",
        "published_date": "2025-04-13T05:01:48-04:00",
        "url": "https://www.nytimes.com/2025/04/13/business/529-investments-stock-market.html"
    },
    {
        "title": "Palin v. New York Times Heads Back to Trial",
        "abstract": "The case centers on the former Alaska governor’s claim that an editorial published in 2017 defamed her.",
        "published_date": "2025-04-13T12:57:34-04:00",
        "url": "https://www.nytimes.com/2025/04/13/business/palin-v-new-york-times-defamation-trial.html"
    },
    {
        "title": "How Much Are Tariffs on Chinese Goods? It’s Trickier Than You Think.",
        "abstract": "The tariff rate on Chinese imports can be as high as 245% or zero, depending on the type of product that is being imported.",
        "published_date": "2025-04-12T05:03:12-04:00",
        "url": "https://www.nytimes.com/interactive/2025/04/12/business/economy/china-tariff-product-costs.html"
    },
    {
        "title": "British Government Takes Control of Country’s Last Major Steel Mill",
        "abstract": "London says it acted to prevent the plant’s Chinese owners from closing the plant, threatening jobs and national security.",
        "published_date": "2025-04-12T13:38:09-04:00",
        "url": "https://www.nytimes.com/2025/04/12/business/british-government-steel-mill.html"
    },
    {
        "title": "Your Car Insurance Is Likely to Go Up. Again.",
        "abstract": "New tariffs are expected to push up prices of vehicles and car parts, and that could raise premiums as much as 16 percent. Here are some tips on how to try to keep costs down.",
        "published_date": "2025-04-11T09:00:05-04:00",
        "url": "https://www.nytimes.com/2025/04/11/your-money/car-insurance-tariffs.html"
    },
    {
        "title": "Trump Adds Tariff Exemptions for Smartphones, Computers and Other Electronics",
        "abstract": "A long list of electronic products got a reprieve for now from at least some of the levies on China, which had been expected to take a toll on tech giants like Apple.",
        "published_date": "2025-04-12T10:27:59-04:00",
        "url": "https://www.nytimes.com/2025/04/12/technology/trump-electronics-tariffs.html"
    },
    {
        "title": "How a Deal to Shape Golf’s Future Went Cold",
        "abstract": "Despite interventions by President Trump, talks to combine the PGA Tour and LIV Golf have come to a standstill.",
        "published_date": "2025-04-12T08:00:04-04:00",
        "url": "https://www.nytimes.com/2025/04/12/business/dealbook/liv-pga-deal.html"
    },
    {
        "title": "Raise Prices? Eat Higher Costs? Retailers Face Tough Questions.",
        "abstract": "A trade war with China and tariff threats on other countries are ramping up pressure on stores that sell products from overseas — which, for some categories, is just about all of them.",
        "published_date": "2025-04-12T05:03:10-04:00",
        "url": "https://www.nytimes.com/2025/04/12/business/retailers-tariffs-uncertainty.html"
    },
    {
        "title": "As Tariffs Hit, Americans Are Racing to Buy Car Seats, iPhones and Christmas Gifts",
        "abstract": "Many Americans have purchased foreign-made products out of fears that companies could start to raise prices soon.",
        "published_date": "2025-04-12T05:02:07-04:00",
        "url": "https://www.nytimes.com/2025/04/12/us/politics/tariffs-china-iphones-panic-shopping.html"
    },
    {
        "title": "Bessent Takes Tricky Center Stage as Trade Wars Roil U.S. Economy",
        "abstract": "The Treasury secretary received counsel and criticism from some of his predecessors over President Trump’s policies.",
        "published_date": "2025-04-12T05:02:07-04:00",
        "url": "https://www.nytimes.com/2025/04/12/us/politics/bessent-trump-treasury-tariffs.html"
    },
    {
        "title": "How to Ease Your Money Anxiety When the Economy Is Stressing You Out",
        "abstract": "Wild stock market swings and rising recession fears have put Americans on edge. Here are strategies to lower the angst.",
        "published_date": "2025-04-12T05:01:58-04:00",
        "url": "https://www.nytimes.com/2025/04/12/business/money-anxiety-stock-market.html"
    },
    {
        "title": "How the Crypto Industry’s Political Spending Is Paying Off",
        "abstract": "Federal lawmakers who benefited from crypto largess in the 2024 election are speedily advancing the industry’s agenda.",
        "published_date": "2025-04-12T05:01:24-04:00",
        "url": "https://www.nytimes.com/2025/04/12/technology/crypto-congress-financing-lobbying.html"
    },
    {
        "title": "The Bees Are Disappearing Again",
        "abstract": "For beekeepers, the problem isn’t just climate change and extreme weather: It’s also DOGE, the trade war and the immigration crackdown.",
        "published_date": "2025-04-12T05:00:26-04:00",
        "url": "https://www.nytimes.com/2025/04/12/business/honeybees-colony-collapse.html"
    },
    {
        "title": "Appeals Court Scales Back Freeze on Firing Consumer Bureau Employees",
        "abstract": "The order reversed some parts of an injunction a federal judge said was needed to prevent the Consumer Financial Protection Bureau from being illegally dismantled.",
        "published_date": "2025-04-11T22:59:23-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/cfpb-ruling-appeals-court.html"
    },
    {
        "title": "Rick Levine, Who Gave Commercials Cinematic Flair, Dies at 94",
        "abstract": "An award-winning director, he created ads for brands like Diet Pepsi (starring Michael J. Fox) by bringing a Hollywood sensibility to the small screen.",
        "published_date": "2025-04-11T17:37:25-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/media/rick-levine-dead.html"
    },
    {
        "title": "Five More Big Law Firms Reach Deals With Trump",
        "abstract": "Kirkland & Ellis, Latham & Watkins, A&O Shearman, Simpson Thacher & Bartlett and Cadwalader, Wickersham & Taft agreed to do free legal work on causes the White House supports.",
        "published_date": "2025-04-11T16:13:47-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/trump-law-firms-kirkland-ellis-latham-watkins.html"
    },
    {
        "title": "Kennedy Accuses F.D.A. of Drug Industry Influence That Barred Alternative Remedies",
        "abstract": "The nation’s health secretary addressed agency employees, asking them to shed any corporate influence. But he did not address the mass layoffs that have gutted oversight of tobacco and vapes, food safety and drug reviews.",
        "published_date": "2025-04-11T16:04:17-04:00",
        "url": "https://www.nytimes.com/2025/04/11/health/rfk-jr-fda-drug-industry-alternative-medicine.html"
    },
    {
        "title": "Stocks Post Gain for the Week, but Investors Remain Anxious",
        "abstract": "While the S&P 500 rose, other corners of the financial markets showed that investors expect big swings to continue.",
        "published_date": "2025-04-11T15:46:58-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/stock-market-tariffs-trump.html"
    },
    {
        "title": "Investors Seeking Safety Look to German Government Bonds",
        "abstract": "The country’s debt is in demand amid the chaos in financial markets spurred by whipsawing U.S. tariff policies.",
        "published_date": "2025-04-11T14:10:50-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/economy/germany-tariffs-bonds.html"
    },
    {
        "title": "Fed Under Pressure as Inflation Expectations Surge",
        "abstract": "A new survey from the University of Michigan shows consumers souring sharply on the economic outlook as the trade war heats up.",
        "published_date": "2025-04-11T13:44:26-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/economy/fed-inflation-trade.html"
    },
    {
        "title": "‘This is Not Normal’: Trump’s Tariffs Upend the Bond Market",
        "abstract": "In the usually steady government bond market, the yield on the 10-year Treasury has risen to about 4.5 percent from less than 4 percent at the end of last week.",
        "published_date": "2025-04-11T13:09:11-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/economy/treasury-bonds-tariffs.html"
    },
    {
        "title": "What to Know About Who Pays the Higher Costs of Trump’s Tariffs",
        "abstract": "President Trump’s trade policies will make imports more expensive and calculating and paying the tariffs more complicated.",
        "published_date": "2025-04-11T12:55:56-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/economy/trump-tariffs-imports-costs.html"
    },
    {
        "title": "Europe Moves to Shield Itself From Trade War Fallout",
        "abstract": "The uncertainty of higher tariffs has spurred Germany, Italy, Portugal and Spain to announce financial lifelines for businesses and workers. More countries are expected to follow.",
        "published_date": "2025-04-11T12:49:48-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/trump-tariffs-eu.html"
    },
    {
        "title": "Pig Kidney Removed From Alabama Woman After Organ Rejection",
        "abstract": "Towana Looney lived with the kidney longer than any other transplant patient had tolerated an organ from a genetically modified animal.",
        "published_date": "2025-04-11T12:06:45-04:00",
        "url": "https://www.nytimes.com/2025/04/11/health/pig-kidney-transplant-looney.html"
    },
    {
        "title": "Trump Showed His Pain Point in His Standoff With China",
        "abstract": "Xi Jinping, who rules with absolute authority, has shown he is willing to let the Chinese people endure hardship. President Trump revealed he has limits.",
        "published_date": "2025-04-11T11:31:14-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/us-china-tariffs-trump-xi.html"
    },
    {
        "title": "Tesla U.S. Sales Plunge as G.M. and Others Make Gains",
        "abstract": "Overall sales of electric vehicles rose almost 11 percent in the first three months of the year as traditional carmakers offered new models.",
        "published_date": "2025-04-11T09:53:45-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/tesla-sales-elon-musk.html"
    },
    {
        "title": "World’s Friendliest Superpower? As Trump Upends Globe, Europe Positions Itself.",
        "abstract": "Ursula von der Leyen is trying to ensure that if the international trading system is remade, the E.U. is at the center of what comes next.",
        "published_date": "2025-04-11T08:56:25-04:00",
        "url": "https://www.nytimes.com/2025/04/11/world/europe/european-union-trade-tariffs-trump.html"
    },
    {
        "title": "Markets Worry About Finding an Exit From Trump’s Trade Fight",
        "abstract": "Investors are concerned about the continued escalation of the U.S.-China tariff battle — and the state of the president’s negotiating leverage.",
        "published_date": "2025-04-11T07:38:27-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/dealbook/trump-tariffs-trade-assets.html"
    },
    {
        "title": "Warren Urges S.E.C. to Investigate Trading Around Trump’s Tariff Pause",
        "abstract": "The president told his social media followers it was a “GREAT TIME TO BUY” hours before announcing a reversal on tariffs that sent markets soaring.",
        "published_date": "2025-04-11T07:30:02-04:00",
        "url": "https://www.nytimes.com/2025/04/11/business/dealbook/warren-trump-sec.html"
    }
]