[
    {
        "title": "Stock market today: Dow, S&P 500, Nasdaq futures rise as tech gets a temporary tariff reprieve",
        "summary": "Wall Street is bracing for another week of tariff-fueled whiplash.",
        "published_date": "Sun, 13 Apr 2025 22:12:44 +0000",
        "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-nasdaq-futures-rise-as-tech-gets-a-temporary-tariff-reprieve-221244481.html?.tsrc=rss"
    },
    {
        "title": "Corporate earnings take center stage amid tariff turmoil: What to know this week",
        "summary": "A slew of corporate earnings are expected in the week ahead as tariff headlines have been whipsawing markets.",
        "published_date": "Sun, 13 Apr 2025 20:29:58 +0000",
        "link": "https://finance.yahoo.com/news/corporate-earnings-take-center-stage-amid-tariff-turmoil-what-to-know-this-week-113650156.html?.tsrc=rss"
    },
    {
        "title": "Just to break even after the recent selloff, stocks will need to have the sort of rally that only happens during bull markets",
        "summary": "Here is how much the S&amp;P 500, the Nasdaq 100, and the Dow need to gain to finish the year where they started.",
        "published_date": "Sun, 13 Apr 2025 15:40:14 +0000",
        "link": "https://finance.yahoo.com/news/just-break-even-recent-selloff-154014355.html?.tsrc=rss"
    },
    {
        "title": "Investor tips for buying the dip & navigating volatility",
        "summary": "In today's volatile market (^GSPC, ^IXIC, ^DJI), investors are grappling with the challenge of determining which dips are worth buying. Northwestern Mutual Wealth Management chief portfolio manager of equities Matt Stucky joins Wealth to discuss navigating this uncertainty. To watch more expert insights and analysis on the latest market action, check out more Wealth here.",
        "published_date": "Sun, 13 Apr 2025 14:00:28 +0000",
        "link": "https://finance.yahoo.com/video/investor-tips-buying-dip-navigating-140028920.html?.tsrc=rss"
    },
    {
        "title": "Market chaos signals 'sell America' trade as Trump tariff whipsaw threatens to upend the US economy's soft landing",
        "summary": "Here's what Wall Street is saying about another chaotic week for markets.",
        "published_date": "Sun, 13 Apr 2025 13:30:45 +0000",
        "link": "https://finance.yahoo.com/news/market-chaos-signals-sell-america-trade-as-trump-tariff-whipsaw-threatens-to-upend-the-us-economys-soft-landing-133045914.html?.tsrc=rss"
    },
    {
        "title": "History Says This Is What Comes Next After a Market Crash and When Stocks Might Recover",
        "summary": "With the stock market crashing, investors may be wondering where the market is heading from here and when stocks may recover.  There have been several market crashes over the past 100 years, so let's look what history has to say.  The market would bottom on March 23, with the S&amp;P 500 declining by another 9.8%.",
        "published_date": "Sat, 12 Apr 2025 14:05:00 +0000",
        "link": "https://www.fool.com/investing/2025/04/12/history-says-this-is-what-comes-next-after-a-marke/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=0466cdb9-5aca-4760-85ab-cc73cd2eb52a&.tsrc=rss"
    },
    {
        "title": "'Global diversification is back' as US exceptionalism fades",
        "summary": "Markets (^GSPC, ^IXIC, ^DJI) are shifting as investors look beyond the once-dominant \"Magnificent Seven\" and focus on international equities gaining traction. Horizon Investments head of research and quantitative strategies Mike Dickson joins Market Domination to discuss why global diversification may be the new core strategy as capital moves away from US assets. To watch more expert insights and analysis on the latest market action, check out more Market Domination here.",
        "published_date": "Sat, 12 Apr 2025 12:00:05 +0000",
        "link": "https://finance.yahoo.com/video/global-diversification-back-us-exceptionalism-120005664.html?.tsrc=rss"
    },
    {
        "title": "The tariff uncertainty isn't getting any better in markets: Chart of the Week",
        "summary": "Markets have failed to make a full recovery from President Trump's initial tariff announcement as uncertainty around exactly where policy lands remains paramount.",
        "published_date": "Sat, 12 Apr 2025 10:00:29 +0000",
        "link": "https://finance.yahoo.com/news/the-tariff-uncertainty-isnt-getting-any-better-in-markets-chart-of-the-week-100029155.html?.tsrc=rss"
    },
    {
        "title": "Making the most of market volatility: FP Video on the latest tariff tangents",
        "summary": "Watch: Protecting your investments from trade war turmoil, auto industry concerns and cashing in on the Canadian Arctic",
        "published_date": "Sat, 12 Apr 2025 10:00:19 +0000",
        "link": "https://ca.finance.yahoo.com/news/making-most-market-volatility-fp-100019014.html?.tsrc=rss"
    },
    {
        "title": "Wall Street's Volatility Index (VIX) Has Done This 21 Times in the Last 35 Years -- and It Has a Perfect Track Record of Forecasting Future Stock Moves",
        "summary": "Under rare circumstances, the CBOE Volatility Index has a 100% success rate forecasting directional moves in the S&amp;P 500.",
        "published_date": "Sat, 12 Apr 2025 07:06:00 +0000",
        "link": "https://www.fool.com/investing/2025/04/12/wall-street-vix-21-times-perfect-record-stock-move/?source=eptyholnk0000202&utm_source=yahoo-host-full&utm_medium=feed&utm_campaign=article&referring_guid=2d3b1515-9f4b-4132-8b32-ebdb946d6d42&.tsrc=rss"
    },
    {
        "title": "How One of the Wildest Weeks in Market History Unfolded",
        "summary": "A tense, volatile week on Wall Street ended with all three major U.S. indexes up 5% or more, yet still below where they were when President Trump launched his tariff blitz.",
        "published_date": "Sat, 12 Apr 2025 01:00:00 +0000",
        "link": "https://www.wsj.com/finance/investing/how-one-of-the-wildest-weeks-in-market-history-unfolded-41353450?.tsrc=rss"
    },
    {
        "title": "Stocks Rise as White House Says Trump Optimistic About China Trade Deal",
        "summary": "US benchmark equity indexes closed higher Friday as the White House said President Donald Trump is o",
        "published_date": "Fri, 11 Apr 2025 20:52:19 +0000",
        "link": "https://finance.yahoo.com/news/stocks-rise-white-house-says-205219627.html?.tsrc=rss"
    },
    {
        "title": "How major US stock indexes fared Friday, 4/11/2025",
        "summary": "U.S. stocks jumped in another manic day on Wall Street, but the falling value of the U.S. dollar and other swings in financial markets suggest worries about President Donald Trump's trade war remain high. The S&amp;P 500 rose 1.8% Friday after veering between gains and losses, closing a historic week full of monstrous swings. The Dow Jones Industrial Average went from an early loss of nearly 340 points to a gain of 810 before closing with a gain of 619 points.",
        "published_date": "Fri, 11 Apr 2025 20:26:13 +0000",
        "link": "https://finance.yahoo.com/news/major-us-stock-indexes-fared-202613669.html?.tsrc=rss"
    },
    {
        "title": "Bond market sell-off 'severe' as long-term yields notch biggest week since 1982",
        "summary": "As concerns mount over the health of the US economy, rising skepticism over the stability of traditional safe-haven assets such as Treasury yields and the US dollar may trigger broader disruptions throughout the entire financial system.",
        "published_date": "Fri, 11 Apr 2025 20:18:47 +0000",
        "link": "https://finance.yahoo.com/news/bond-market-sell-off-severe-as-long-term-yields-notch-biggest-week-since-1982-170057642.html?.tsrc=rss"
    },
    {
        "title": "Stocks jump at end of roller-coaster week while de-dollarization trade continues to slam the greenback and U.S. bonds",
        "summary": "Elsewhere in financial markets, the mood was gloomier and pointed to deteriorating confidence in U.S. assets.",
        "published_date": "Fri, 11 Apr 2025 20:13:00 +0000",
        "link": "https://finance.yahoo.com/news/stocks-jump-end-roller-coaster-201300688.html?.tsrc=rss"
    },
    {
        "title": "Stocks Post Strong Finish as Bond Worries Take Center Stage",
        "summary": "The stock market wrapped up a wild week of trading with some solid gains as worries in the bond market took center stage.  The S&amp;P 500 gained 1.8%, while the Nasdaq Composite moved 2.1% higher.  “The upward action in rates has been rapid in historical context and has provided no comfort to investors looking for havens in turbulent markets,” writes Citi strategist Scott Chronert.",
        "published_date": "Fri, 11 Apr 2025 20:06:06 +0000",
        "link": "https://finance.yahoo.com/m/92b4fde7-ab23-3ec4-9857-47f410e06596/stocks-post-strong-finish-as.html?.tsrc=rss"
    },
    {
        "title": "Stock Market Set to Finish Volatile Week Higher on Friday Amid Looming Tariff Worries",
        "summary": "US equities were set to finish on a higher note Friday, ending a volatile week, as investors struggl",
        "published_date": "Fri, 11 Apr 2025 20:04:34 +0000",
        "link": "https://finance.yahoo.com/news/stock-market-set-finish-volatile-200434043.html?.tsrc=rss"
    },
    {
        "title": "Trump has 90 days to do 150 trade deals. Financial markets aren’t buying it",
        "summary": "President Donald Trump and his advisers said this was the plan all along: Scare the bejesus out of the world by announcing astronomically high tariffs, get countries to come to the negotiating table, and — with the exception of China — back away from the most punishing trade barriers as America works out new trade agreements around the globe.",
        "published_date": "Fri, 11 Apr 2025 20:04:11 +0000",
        "link": "https://www.cnn.com/2025/04/11/investing/stock-market-dow-tariffs?.tsrc=rss"
    },
    {
        "title": "Stock market today: Dow, S&P 500 post best week since 2023 to cap wild week of tariff-fueled chaos",
        "summary": "Wall Street is set to wrap up another week of tariff-fueled turmoil.",
        "published_date": "Fri, 11 Apr 2025 20:02:22 +0000",
        "link": "https://finance.yahoo.com/news/live/stock-market-today-dow-sp-500-post-best-week-since-2023-to-cap-wild-week-of-tariff-fueled-chaos-200222921.html?.tsrc=rss"
    },
    {
        "title": "Equities Rise Intraday After Bank Earnings",
        "summary": "US benchmark equity indexes were higher intraday as major banks reported stronger-than-expected bott",
        "published_date": "Fri, 11 Apr 2025 18:02:38 +0000",
        "link": "https://finance.yahoo.com/news/equities-rise-intraday-bank-earnings-180238055.html?.tsrc=rss"
    }
]